УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПодборСерийВДокументы/ПодборСерийВДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="642d1ac9-63b1-4b94-9871-5b02fd12709f">
  <name>ПодборСерийВДокументы</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/НоменклатураСегмента/НоменклатураСегмента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НоменклатураСегмента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПодборСерийВДокументы/Forms/УказаниеСерииВСтрокеТоваров/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
Процедура смарт_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка) 
    //++ #1250 смарт: Фролов 17.11.2022 //Проверенное оборудование. "Запрет на отгрузку без проверки оборудования  #1143 "  
	//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 27.01.2021 17:32:58   задача 444
	//ДобавляемыеРеквизиты	= Новый Массив;
	//НовыйРеквизит = Новый РеквизитФормы("смартПроверен",	Новый ОписаниеТипов("Булево"),"ОстаткиСерий","");		
	//ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);   
	
	ДобавляемыеРеквизиты	= Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("смартСтатусПроверкиОборудования",	Новый ОписаниеТипов("Перечислениессылка.смартСтатусыПроверкиОборудованияПоСерии"),"ОстаткиСерий","");		
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);   
    //-- #1250 смарт: Фролов 17.11.2022
	
    //++ смарт:Подкин #1143 17.08.2022 14:38:58 
    Если Параметры.Свойство("Номенклатура") Тогда
        НовыйРеквизит = Новый РеквизитФормы("смартНоменклатура",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
        ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);  	
    КонецЕсли;  
    
    Если Параметры.Свойство("Регистратор") Тогда
        НовыйРеквизит = Новый РеквизитФормы("смартРегистратор",     Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
        ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
    КонецЕсли;
    //-- смарт:Подкин #1143 17.08.2022 14:38:58
    //++ #1250 смарт: Фролов 17.11.2022 //Проверенное оборудование. "Запрет на отгрузку без проверки оборудования  #1143 " 
    Если Параметры.Свойство("Характеристика") Тогда
        НовыйРеквизит = Новый РеквизитФормы("смартХарактеристика",	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
        ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);  	
    КонецЕсли;  
	//-- #1250 смарт: Фролов 17.11.2022
	
    
	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
    
    Если Параметры.Свойство("Номенклатура") Тогда
        Этаформа.смартНоменклатура = Параметры.Номенклатура;	
    КонецЕсли; 
    
    Если Параметры.Свойство("Регистратор") Тогда
        ЭтаФорма.смартРегистратор = Параметры.Регистратор;
    КонецЕсли;
	//Смарт }Подкин Алексей Иванович 27.01.2021 17:32:58 
	
	//++ #1250 смарт: Фролов 17.11.2022 //Проверенное оборудование. "Запрет на отгрузку без проверки оборудования  #1143 "
    Если Параметры.Свойство("Характеристика") Тогда
        Этаформа.смартХарактеристика = Параметры.Характеристика;	
	КонецЕсли;
	//-- #1250 смарт: Фролов 17.11.2022
КонецПроцедуры

//++ #1250 смарт: Фролов 21.11.2022 //Проверенное оборудование. "Запрет на отгрузку без проверки оборудования  #1143 "  
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка) 
	
	ЗапросН=Новый Запрос("ВЫБРАТЬ
	                    |	НоменклатураСегмента.Номенклатура КАК Номенклатура
	                    |ИЗ
	                    |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	                    |ГДЕ
	                    |	НоменклатураСегмента.Номенклатура = &Номенклатура
	                    |	И НоменклатураСегмента.Характеристика = &Характеристика
	                    |	И НоменклатураСегмента.Сегмент = &Сегмент");
	ЗапросН.УстановитьПараметр("Номенклатура",ЭтаФорма.смартНоменклатура); 
	ЗапросН.УстановитьПараметр("Характеристика",ЭтаФорма.смартХарактеристика);
	ЗапросН.УстановитьПараметр("Сегмент",Справочники.смартПредопределенныеЗначения.СегментПроверкаОборудования.Значение);
	ВыборкаН=ЗапросН.Выполнить().Выбрать();
	Если ВыборкаН.Следующий() Тогда	
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	СерииНоменклатуры.Ссылка КАК Серия
					|ИЗ
					|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
					|ГДЕ
					|	СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.ПровереноИсправно)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	СерииНоменклатуры.Ссылка КАК Серия
					|ИЗ
					|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
					|ГДЕ
					|	НЕ СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.ПровереноИсправно)
					|	И НЕ СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.ПровереноНеИсправно)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	СерииНоменклатуры.Ссылка КАК Серия
					|ИЗ
					|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
					|ГДЕ
					|	СерииНоменклатуры.смартСтатусПроверкиОборудования = ЗНАЧЕНИЕ(Перечисление.смартСтатусыПроверкиОборудованияПоСерии.ПровереноНеИсправно)"); 

		МасРезультатов=Запрос.ВыполнитьПакет();
		СпсИсправно=Новый СписокЗначений;
		СпсИсправно.ЗагрузитьЗначения(МасРезультатов[0].Выгрузить().ВыгрузитьКолонку("Серия"));
		СпсНеПроверено=Новый СписокЗначений;
		СпсНеПроверено.ЗагрузитьЗначения(МасРезультатов[1].Выгрузить().ВыгрузитьКолонку("Серия")); 
		СпсНеИсправно=Новый СписокЗначений;
		СпсНеИсправно.ЗагрузитьЗначения(МасРезультатов[2].Выгрузить().ВыгрузитьКолонку("Серия"));
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОстаткиСерий.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиСерий.Серия");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента.ПравоеЗначение = СпсИсправно;

		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBцвета.БледноЗеленый);
		
		Элемент2 = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента2 = Элемент2.Поля.Элементы.Добавить();
		ПолеЭлемента2.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОстаткиСерий.Имя);
		
		ОтборЭлемента2 = Элемент2.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиСерий.Серия");
		ОтборЭлемента2.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента2.ПравоеЗначение = СпсНеПроверено;

		Элемент2.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBцвета.Лосось); 
		
		Элемент3 = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента3 = Элемент3.Поля.Элементы.Добавить();
		ПолеЭлемента3.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОстаткиСерий.Имя);
		
		ОтборЭлемента3 = Элемент3.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОстаткиСерий.Серия");
		ОтборЭлемента3.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента3.ПравоеЗначение = СпсНеИсправно;

		Элемент3.Оформление.УстановитьЗначениеПараметра("ЦветФона", WEBцвета.Лосось);
		Элемент3.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина,Истина,,Истина)); 
		
		ГруппаЛегенда = ЭтаФорма.Элементы.Добавить("ГруппаЛегенда1", Тип("ГруппаФормы"),Элементы.СтраницаОстаткиСерий);
		ГруппаЛегенда.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЛегенда.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаЛегенда.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаЛегенда.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ТекстЛегенды", Тип("ДекорацияФормы"),ГруппаЛегенда);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = "Серия";
		НовыйЭлемент.ЦветФона=WEBцвета.БледноЗеленый; 
		НовыйЭлемент1 = ЭтаФорма.Элементы.Добавить("ТекстЛегенды2", Тип("ДекорацияФормы"),ГруппаЛегенда);
		НовыйЭлемент1.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент1.Заголовок = " - статус проверки оборудования ""Проверено - исправно""";  
		
		ГруппаЛегенда1 = ЭтаФорма.Элементы.Добавить("ГруппаЛегенда2", Тип("ГруппаФормы"),Элементы.СтраницаОстаткиСерий);
		ГруппаЛегенда1.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЛегенда1.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаЛегенда1.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаЛегенда1.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		НовыйЭлемент2 = ЭтаФорма.Элементы.Добавить("ТекстЛегенды3", Тип("ДекорацияФормы"),ГруппаЛегенда1);
		НовыйЭлемент2.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент2.Заголовок = "Серия";
		НовыйЭлемент2.ЦветФона=WEBцвета.Лосось; 
		НовыйЭлемент3 = ЭтаФорма.Элементы.Добавить("ТекстЛегенды4", Тип("ДекорацияФормы"),ГруппаЛегенда1);
		НовыйЭлемент3.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент3.Заголовок = " - статус проверки оборудования ""Не проверено""";  
		
		ГруппаЛегенда2 = ЭтаФорма.Элементы.Добавить("ГруппаЛегенда3", Тип("ГруппаФормы"),Элементы.СтраницаОстаткиСерий);
		ГруппаЛегенда2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЛегенда2.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаЛегенда2.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаЛегенда2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
		НовыйЭлемент4 = ЭтаФорма.Элементы.Добавить("ТекстЛегенды5", Тип("ДекорацияФормы"),ГруппаЛегенда2);
		НовыйЭлемент4.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент4.Заголовок = "Серия";
		НовыйЭлемент4.Шрифт=Новый Шрифт(,,Истина,Истина,,Истина);
		НовыйЭлемент4.ЦветФона=WEBцвета.Лосось; 
		НовыйЭлемент5 = ЭтаФорма.Элементы.Добавить("ТекстЛегенды6", Тип("ДекорацияФормы"),ГруппаЛегенда2);
		НовыйЭлемент5.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент5.Заголовок = " - статус проверки оборудования ""Проверено - НЕ исправно""";
	КонецЕсли;
	
КонецПроцедуры
//-- #1250 смарт: Фролов 21.11.2022
	
#КонецОбласти
